In [1]:
import pandas as pd

In [3]:
# Dictionary로 데이터 프레임 생성
df = pd.DataFrame(
    {
        'c0' : [1,2,3],
        'c1' : [4,5,6],
        'c2' : [7,8,9],
        'c3' : [10,11,12],
        'c4' : [13,14,15],
    }
)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
# List를 이용한 Dataframe 생성
df = pd.DataFrame(
    [
        [15, '남', '덕영중'],
        [17, '여', '수리중']
    ],
    index=['준서', '예은'],
    columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [7]:
# df에서 index만 추출하기
df.index

Index(['준서', '예은'], dtype='object')

In [8]:
# df에서 Column만 추출하기
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [10]:
# df의 index를 학생1, 학생2로 변경 - 1
df.index = ['학생1','학생2']
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [12]:
# 컬럼명 변경하기 : 나이 -> 연령 - 1
df.columns = ['연령','성별','학교']
df

     연령 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [13]:
# List를 이용한 Dataframe 생성
df = pd.DataFrame(
    [
        [15, '남', '덕영중'],
        [17, '여', '수리중']
    ],
    index=['준서', '예은'],
    columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [15]:
# 필요한 컬럼명을 변경 : 나이 -> 연령, 학교 -> 소속
df.rename(
    columns={
        '나이' : '연령',
        '학교' : '소속'
    },
    inplace=True
)
df

    연령 성별   소속
준서  15  남  덕영중
예은  17  여  수리중

In [16]:
# Ex : 준서 -> 학생1로 변경
df.rename(
    index={
        '준서' : '학생1'
    },
    inplace=True
)
df

     연령 성별   소속
학생1  15  남  덕영중
예은   17  여  수리중

---
### 행 삭제

In [17]:
exam_data = {
    '수학' : [90, 80, 70],
    '영어' : [98, 89, 95],
    '음악' : [85, 95, 100],
    '체육' : [100, 90, 90]
}

df = pd.DataFrame(
    exam_data,
    index=['서준','우현','인아']
)
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [23]:
# Dataframe 복제
df2 = df.copy()

In [ ]:
# df2의 index가 우현인 1개 행을 삭제
df2.drop(
    '우현',
    # axis='rows', # 기본값은 'rows'
    inplace=True
)
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [27]:
df3 = df.copy()
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [28]:
# df3의 index가 우현과 인아 2개 행을 삭제
df3.drop(
    ['우현','인아'],
    axis='rows',
    inplace=True
)
df3

    수학  영어  음악   체육
서준  90  98  85  100

---
### 열 삭제

In [29]:
df4 = df.copy()
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [31]:
# 수학 열을 삭제
df4.drop(
    '수학',
    axis='columns',
    inplace=True
)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [42]:
df5 = df.copy()
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [43]:
# df5의 영어와 음악 컬럼을 삭제
df5.drop(
    ['영어','음악'],
    axis='columns',
    inplace=True
)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

---
### 행 선택
- loc : 행의 이름으로 선택
- iloc : 행의 정수형 index로 선택

In [45]:
df.loc['서준',:]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [47]:
df.iloc[0,:]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [48]:
exam_data = {
    '이름' : ['서준','우현','인아'],
    '수학' : [90, 80, 70],
    '영어' : [98, 89, 95],
    '음악' : [85, 95, 100],
    '체육' : [100, 90, 90]
}

df = pd.DataFrame(
    exam_data
)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

### 범위 slicing
:df.iloc[시작index:끝index+1:증가치]

In [50]:
df.iloc[::2,:]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [51]:
df.iloc[0:2+1:2,:]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [53]:
# iloc로 내림차순 
df.iloc[::-1,:]

   이름  수학  영어   음악   체육
2  인아  70  95  100   90
1  우현  80  89   95   90
0  서준  90  98   85  100